<?php

$level1 = "緑";

switch ($level1)
{
    case "赤";
        print ("あんたの好きな色は・・・<br><br><br>赤や！");
        break;

    case "青";
        print ("えぇ・・・青かよ");
        break;

    case "緑";
        print ("みどりを探せ！！！<br>
                縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>
                縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>
                縁縁縁縁緑縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>
                縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>
                縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>
                縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>
                縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>
                縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁縁<br>"
            　);
        break;

    case "黄";
        print ("黄色より赤がええぞ！");
        break;
}

?>
